In [1]:
#  puzzle-1
import pandas as pd
data=[["Alice", 25, "NEw York"], ["Chaerlie", 35, "Los Ageles"], ["Bob", 30, "San Francisco"],["david", 40, "Chicago"]]
df=pd.DataFrame(data, columns=("First Name", "Age", "City" ))
print(df)
df_1=df.rename(columns={"First Name": "first_naame", "Age":"age"})
print(df_1)
df_1.head(3)
x=df_1.nlargest(3, "age")
print(x)

  First Name  Age           City
0      Alice   25       NEw York
1   Chaerlie   35     Los Ageles
2        Bob   30  San Francisco
3      david   40        Chicago
  first_naame  age           City
0       Alice   25       NEw York
1    Chaerlie   35     Los Ageles
2         Bob   30  San Francisco
3       david   40        Chicago
  first_naame  age           City
3       david   40        Chicago
1    Chaerlie   35     Los Ageles
2         Bob   30  San Francisco

In [4]:
import pandas as pd
data=[["Alice", 25, "NEw York"], ["Chaerlie", 35, "Los Ageles"], ["Bob", 30, "San Francisco"],["david", 40, "Chicago"]]
df_2=pd.DataFrame(data, columns=("First Name", "Age", "City" ))
print(df_2)
df_2.mean(numeric_only=True)

  First Name  Age           City
0      Alice   25       NEw York
1   Chaerlie   35     Los Ageles
2        Bob   30  San Francisco
3      david   40        Chicago

Age    32.5
dtype: float64

In [3]:
print(df_2[["First Name", "City"]])

NameError: name 'df_2' is not defined

In [13]:
import numpy as np
df_2["salary"]=np.random.randint(1, 1000, size=len(df_2))
print(df_2)

  First Name  Age           City  salary
0      Alice   25       NEw York     206
1   Chaerlie   35     Los Ageles     329
2        Bob   30  San Francisco      24
3      david   40        Chicago     918

In [20]:
x=df_2.describe()
print(x)

             Age      salary
count   4.000000    4.000000
mean   32.500000  369.250000
std     6.454972  386.693138
min    25.000000   24.000000
25%    28.750000  160.500000
50%    32.500000  267.500000
75%    36.250000  476.250000
max    40.000000  918.000000

In [24]:
# homework 2
# Create a DataFrame named sales_and_expenses with columns 'Month', 'Sales', and 'Expenses',
#  representing monthly sales and expenses data. Use below table.

import pandas as pd
data=[["Jan",5000, 3000],["Feb", 6000, 3500], ["MAr", 7500, 4000], ["Apr", 8000, 4500]]
df=pd.DataFrame(data, columns=("Month", "Sales", "Expenses"))
print(df)
df.describe()

  Month  Sales  Expenses
0   Jan   5000      3000
1   Feb   6000      3500
2   MAr   7500      4000
3   Apr   8000      4500

             Sales     Expenses
count     4.000000     4.000000
mean   6625.000000  3750.000000
std    1376.892637   645.497224
min    5000.000000  3000.000000
25%    5750.000000  3375.000000
50%    6750.000000  3750.000000
75%    7625.000000  4125.000000
max    8000.000000  4500.000000

In [41]:
#puzzle 3 Create a DataFrame named expenses with columns 'Category', 'January', 'February', 'March', and 'April', 
# representing monthly expenses for different categories. Use below table.
import pandas as pd
data={"Category":["Rent", "Utilities","Groceries", "Entertainment"],  "January": [1200, 200, 300, 150]
      ,"February":[ 1300, 220, 320, 160], "March": [1400, 240, 330, 170],  "April":[1500, 250, 350,180]}
df=pd.DataFrame(data)
print(df)
df.set_index("Category", inplace=True)
df["max_expenses"]=df.max(axis=1)
df
x=df.sort_values(by="max_expenses", ascending= True)
print("eng katta qiymatlar ketma_ketligi")
print(x)
df["minimum"]=df.min(axis=1)
y=df.sort_values(by="minimum", ascending=True)
print(y)
df["Avg"]=df.mean(axis=1)
z=df.sort_values(by="Avg", ascending=True)
print(z)

        Category  January  February  March  April
0           Rent     1200      1300   1400   1500
1      Utilities      200       220    240    250
2      Groceries      300       320    330    350
3  Entertainment      150       160    170    180
eng katta qiymatlar ketma_ketligi
               January  February  March  April  max_expenses
Category
Entertainment      150       160    170    180           180
Utilities          200       220    240    250           250
Groceries          300       320    330    350           350
Rent              1200      1300   1400   1500          1500
               January  February  March  April  max_expenses  minimum
Category
Entertainment      150       160    170    180           180      150
Utilities          200       220    240    250           250      200
Groceries          300       320    330    350           350      300
Rent              1200      1300   1400   1500          1500     1200
               January  February  March  April  max_expenses  minimum  \
Category
Entertainment      150       160    170    180           180      150
Utilities          200       220    240    250           250      200
Groceries          300       320    330    350           350      300
Rent              1200      1300   1400   1500          1500     1200

                       Avg
Category
Entertainment   165.000000
Utilities       226.666667
Groceries       325.000000
Rent           1350.000000